11월 20일

# 01. 데이터 사전처리 : Pre Processing

## 01_1. 누락 데이터

In [2]:
import seaborn as sns #seaborn : matplotlib을 기반으로 만들어진 고수준 인터페이스, matplotlib의 상위계층
df = sns.load_dataset('titanic') # seaborn 내에 있는 내장 함수

### 누락 데이터 존재 확인

In [3]:
# .value_counts()

nan_deck = df['deck'].value_counts(dropna=False)  #dropna = True/False : NaN 값 미포함/포함
print(nan_deck)                                   #dropna가 false 일경우 nan값 포함

deck
NaN    688
C       59
B       47
D       33
E       32
A       15
F       13
G        4
Name: count, dtype: int64

In [4]:
# .isnull() -> True=NaN, False = NaN 아님, 셀이 NaN이면 해당 위치에 True가 표시되고, NaN이 아니면 False가 표시
print(df.head().isnull())

   survived  pclass    sex    age  sibsp  parch   fare  embarked  class  \
0     False   False  False  False  False  False  False     False  False
1     False   False  False  False  False  False  False     False  False
2     False   False  False  False  False  False  False     False  False
3     False   False  False  False  False  False  False     False  False
4     False   False  False  False  False  False  False     False  False

     who  adult_male   deck  embark_town  alive  alone
0  False       False   True        False  False  False
1  False       False  False        False  False  False
2  False       False   True        False  False  False
3  False       False  False        False  False  False
4  False       False   True        False  False  False

In [5]:
# .notnull() -> True = NaN 아님, False = NaN, isnull과 반대인 경우

print(df.head().notnull())

   survived  pclass   sex   age  sibsp  parch  fare  embarked  class   who  \
0      True    True  True  True   True   True  True      True   True  True
1      True    True  True  True   True   True  True      True   True  True
2      True    True  True  True   True   True  True      True   True  True
3      True    True  True  True   True   True  True      True   True  True
4      True    True  True  True   True   True  True      True   True  True

   adult_male   deck  embark_town  alive  alone
0        True  False         True   True   True
1        True   True         True   True   True
2        True  False         True   True   True
3        True   True         True   True   True
4        True  False         True   True   True

### 누락 데이터 개수 구하기

In [6]:
print(df.head().isnull().sum(axis=0))   # -> NaN 값 개수를 sum
print(df.head().notnull().sum(axis=0))  # -> NaN이 아닌 값 개수를 sum

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       0
class          0
who            0
adult_male     0
deck           3
embark_town    0
alive          0
alone          0
dtype: int64
survived       5
pclass         5
sex            5
age            5
sibsp          5
parch          5
fare           5
embarked       5
class          5
who            5
adult_male     5
deck           2
embark_town    5
alive          5
alone          5
dtype: int64

In [7]:
# .info()
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

### 누락 데이터 제거 : .dropna()

#### 열 단위 제거

In [8]:
import seaborn as sns

df = sns.load_dataset('titanic')
missing_df = df.isnull() # isnull -> null 값이 있을 경우 True 없으면 false

missing_df.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [9]:
# 정확히 어떤 열에 NaN 값이 몇 개 있는지

for col in missing_df.columns: # 데이터 프레임의 각 열에 대해 반복
    missing_count = missing_df[col].value_counts() 
    
    try:
        print(col,":", missing_count[True])  #missing_count(=NaN 값의 수)가 존재하면 개수 출력
    except:
        print(col,":",0)

survived : 0
pclass : 0
sex : 0
age : 177
sibsp : 0
parch : 0
fare : 0
embarked : 2
class : 0
who : 0
adult_male : 0
deck : 688
embark_town : 2
alive : 0
alone : 0

In [10]:
# 특정 조건을 만족하는 열을 모두 삭제
# axis= 0 : 행, axis = 1 : 열
df_thresh = df.dropna(axis=1,thresh=500)  # NaN 값이 500개 이상(thresh), 열 단위(axis=1로 삭제(.dropna())
print(df_thresh.columns)

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'embark_town', 'alive',
       'alone'],
      dtype='object')

#### 행 단위 제거 : 속성 subset

In [11]:
# 속성 subset 활용 : 특정 열에서 데이터가 없는 모든 행 삭제
# how = 'any' : 하나라도 NaN 값을 포함하면 해당 행을 삭제
df_age = df.dropna(subset=['age'],how='any',axis=0)  # subset = NaN 값을 찾을 열, how = 삭제 기준, any는 하나라도 있으면, axis=0은 열 단위가 아닌 행 단위로 찾겠다는 뜻
print(len(df_age))
df_age

714

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
885,0,3,female,39.0,0,5,29.1250,Q,Third,woman,False,NaN,Queenstown,no,False
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [12]:
# 원래 DataFrame에서 'age' 열에 NaN 값을 가진 행 찾기
missing_age_rows = df[df['age'].isnull()]
missing_age_rows

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
17,1,2,male,NaN,0,0,13.0000,S,Second,man,True,NaN,Southampton,yes,True
19,1,3,female,NaN,0,0,7.2250,C,Third,woman,False,NaN,Cherbourg,yes,True
26,0,3,male,NaN,0,0,7.2250,C,Third,man,True,NaN,Cherbourg,no,True
28,1,3,female,NaN,0,0,7.8792,Q,Third,woman,False,NaN,Queenstown,yes,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
859,0,3,male,NaN,0,0,7.2292,C,Third,man,True,NaN,Cherbourg,no,True
863,0,3,female,NaN,8,2,69.5500,S,Third,woman,False,NaN,Southampton,no,False
868,0,3,male,NaN,0,0,9.5000,S,Third,man,True,NaN,Southampton,no,True
878,0,3,male,NaN,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False

In [13]:
import pandas as pd
import numpy as np


# how를 all 로 설정하게되면 age가 nan값 일 경우 그 행 모두 삭제
data = {'name': ['Alice', 'Bob', 'Charlie'],
        'age': [25, np.nan, np.nan],
        'income': [50000, 60000, np.nan]}
df = pd.DataFrame(data)
df = df.dropna(subset=['age'], how='all', axis=0)
df

    name   age   income
0  Alice  25.0  50000.0

### 누락 데이터 치환 : .fillna()

#### 숫자형

In [14]:
import seaborn as sns
df = sns.load_dataset('titanic')

print(df['age'].head(10))
print('\n')

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: age, dtype: float64

In [15]:
# 특정 열의 NaN 값을 다른 데이터의 평균으로 변경하기 1. 평균 mean
mean_age = df['age'].mean(axis=0)        # NaN 값 제외
df['age'].fillna(mean_age,inplace=True)

print(df['age'].head(10))

0    22.000000
1    38.000000
2    26.000000
3    35.000000
4    35.000000
5    29.699118
6    54.000000
7     2.000000
8    27.000000
9    14.000000
Name: age, dtype: float64

In [16]:
# 특정 열의 NaN 값을 다른 데이터의 평균으로 변경하기 2. 중앙값 median
import seaborn as sns
df2 = sns.load_dataset('titanic')

print(df2['age'].head(10))
print('\n')

median_age = df2['age'].median(axis=0)        # NaN 값 제외
df2['age'].fillna(median_age,inplace=True)

print(df2['age'].head(10))

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: age, dtype: float64


0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5    28.0
6    54.0
7     2.0
8    27.0
9    14.0
Name: age, dtype: float64

#### 문자형

In [17]:
import seaborn as sns
df = sns.load_dataset('titanic')

print(df['embark_town'][825:830])
print('\n')

825     Queenstown
826    Southampton
827      Cherbourg
828     Queenstown
829            NaN
Name: embark_town, dtype: object

##### 최빈값

In [18]:
# 승선 도시별 데이터 수 확인하기

most_freq = df['embark_town'].value_counts(dropna=True)  
print(most_freq)

embark_town
Southampton    644
Cherbourg      168
Queenstown      77
Name: count, dtype: int64

In [19]:
# 승선도시별 데이터 수가 가장 많은 곳 확인하기 # idxmax = 최빈값 -> value_counts중에서 nan값 제외하고 최빈값찾는것
# 최빈값 : 가장 자주 나온 숫자 (빈도가 가장 높은 숫자)

most_freq = df['embark_town'].value_counts(dropna=True).idxmax()  
print(most_freq)

Southampton

In [20]:
# 채워넣기

df['embark_town'].fillna(most_freq,inplace=True)
print(df['embark_town'][825:830])

825     Queenstown
826    Southampton
827      Cherbourg
828     Queenstown
829    Southampton
Name: embark_town, dtype: object

##### 인접값 : 속성 method='ffill / bfill'을 활용하기

In [21]:
# method = 'ffill' (forward fill) : 이전 값으로 채우기

import seaborn as sns
df = sns.load_dataset('titanic')

print(df['embark_town'][825:830])
print('\n')

df['embark_town'].fillna(method='ffill',inplace=True) #'ffill'은 forward fill의 약자로, NaN 값을 이전 행의 값으로 채우는 방법                                                      #즉, NaN 값이 나타나면 바로 직전 행의 값으로 해당 NaN을 채웁니다.
print(df['embark_town'][825:830])

825     Queenstown
826    Southampton
827      Cherbourg
828     Queenstown
829            NaN
Name: embark_town, dtype: object


825     Queenstown
826    Southampton
827      Cherbourg
828     Queenstown
829     Queenstown
Name: embark_town, dtype: object

In [22]:
# method = bfill (backward fill) 다음값으로 채우기
import seaborn as sns
df = sns.load_dataset('titanic')

print(df['embark_town'][825:832])
print('\n')

df['embark_town'].fillna(method='bfill',inplace=True)
print(df['embark_town'][825:832])

825     Queenstown
826    Southampton
827      Cherbourg
828     Queenstown
829            NaN
830      Cherbourg
831    Southampton
Name: embark_town, dtype: object


825     Queenstown
826    Southampton
827      Cherbourg
828     Queenstown
829      Cherbourg
830      Cherbourg
831    Southampton
Name: embark_town, dtype: object

## 01_2. 중복 데이터

### 중복 데이터 존재 확인

In [23]:
import pandas as pd

df = pd.DataFrame({'c1':['a','a','b','a','b'],'c2':[1,1,1,2,2],'c3':[1,1,2,2,2]})

print(df)
print('\n')

  c1  c2  c3
0  a   1   1
1  a   1   1
2  b   1   2
3  a   2   2
4  b   2   2

In [24]:
# .duplicated() : 각 행이 이전에 나타난 행과 동일한지 여부를 판단

df_dup = df.duplicated()
print(df_dup)

0    False
1     True
2    False
3    False
4    False
dtype: bool

In [25]:
# 특정 칼럼 안에서 중복값 찾기

col_dup = df['c2'].duplicated()
print(col_dup)

0    False
1     True
2     True
3    False
4     True
Name: c2, dtype: bool

### 중복 데이터 제거

In [26]:
# 중복행 제거
df2 = df.drop_duplicates()
print(df2)

  c1  c2  c3
0  a   1   1
2  b   1   2
3  a   2   2
4  b   2   2

In [27]:
# 특정 열을 기준으로 중복 행 제거
df3 = df.drop_duplicates(subset=['c2','c3'])
print(df3)

  c1  c2  c3
0  a   1   1
2  b   1   2
3  a   2   2

## 01_3. 데이터 표준화

### 단위 변환 
: 같은 데이터 셋에서 서로 다른 측정 단위에 대한 처리

In [28]:
import pandas as pd
df = pd.read_csv('/Users/choejong-gyu/Documents/05.데이터분석/data1/auto-mpg.csv',header=None)

# 칼럼 이름 지정
df.columns = ['mpg','cylinders','displacement','horsepower','weight','acceleration','model year','origin','name']
print(df.head(3))
print('\n')

    mpg  cylinders  displacement horsepower  weight  acceleration  model year  \
0  18.0          8         307.0      130.0  3504.0          12.0          70
1  15.0          8         350.0      165.0  3693.0          11.5          70
2  18.0          8         318.0      150.0  3436.0          11.0          70

   origin                       name
0       1  chevrolet chevelle malibu
1       1          buick skylark 320
2       1         plymouth satellite

In [29]:
# mpg(mile per gallon) : 영미, kpl(killometer per liter) : 한국
# 1 mile = 1.60934km
# 1 gallon = 3.78541L

mpg_to_kpl = 1.60934 / 3.78541 # =0.425 kpl

df['kpl'] = df['mpg'] * mpg_to_kpl
df['kpl'] = df['kpl'].round(2) # 소수점 둘째 자리까지 반올림
print(df.head(3))

    mpg  cylinders  displacement horsepower  weight  acceleration  model year  \
0  18.0          8         307.0      130.0  3504.0          12.0          70
1  15.0          8         350.0      165.0  3693.0          11.5          70
2  18.0          8         318.0      150.0  3436.0          11.0          70

   origin                       name   kpl
0       1  chevrolet chevelle malibu  7.65
1       1          buick skylark 320  6.38
2       1         plymouth satellite  7.65

### 자료형 변환
: .astype('자료형 명칭') -> '자료형 명칭'자료형으로 변함

#### 문자형으로 된 숫자 -> 숫자형

In [30]:
print(df.dtypes)
print(df['horsepower'].unique()) # horsepower에서 고유한 값 출력

mpg             float64
cylinders         int64
displacement    float64
horsepower       object
weight          float64
acceleration    float64
model year        int64
origin            int64
name             object
kpl             float64
dtype: object
['130.0' '165.0' '150.0' '140.0' '198.0' '220.0' '215.0' '225.0' '190.0'
 '170.0' '160.0' '95.00' '97.00' '85.00' '88.00' '46.00' '87.00' '90.00'
 '113.0' '200.0' '210.0' '193.0' '?' '100.0' '105.0' '175.0' '153.0'
 '180.0' '110.0' '72.00' '86.00' '70.00' '76.00' '65.00' '69.00' '60.00'
 '80.00' '54.00' '208.0' '155.0' '112.0' '92.00' '145.0' '137.0' '158.0'
 '167.0' '94.00' '107.0' '230.0' '49.00' '75.00' '91.00' '122.0' '67.00'
 '83.00' '78.00' '52.00' '61.00' '93.00' '148.0' '129.0' '96.00' '71.00'
 '98.00' '115.0' '53.00' '81.00' '79.00' '120.0' '152.0' '102.0' '108.0'
 '68.00' '58.00' '149.0' '89.00' '63.00' '48.00' '66.00' '139.0' '103.0'
 '125.0' '133.0' '138.0' '135.0' '142.0' '77.00' '62.00' '132.0' '84.00'
 '64.00' '74.00' '116.0' '82.00']

In [31]:
# horsepower 열에 누락 데이터 '?' 우선 삭제
import numpy as np

df['horsepower'].replace('?',np.nan,inplace=True) # horsepower열에서 '?'를 nan으로 바꿈
df.dropna(subset=['horsepower'],axis=0,inplace=True) # dropna를 할때 subset은 nan값을 제거할때 어느 열을 기준할지 정함,행을 기준으로 작업 수행
df['horsepower'] = df['horsepower'].astype('float')     # .astype('자료형 명칭') , horsetype열에 astype를 float형으로 변환하는 작업

print(df['horsepower'].dtypes) # horsepower의 타입이 뭔지 알려줌

float64

In [32]:
print(df['horsepower'].unique()) # ?가 사라짐

[130. 165. 150. 140. 198. 220. 215. 225. 190. 170. 160.  95.  97.  85.
  88.  46.  87.  90. 113. 200. 210. 193. 100. 105. 175. 153. 180. 110.
  72.  86.  70.  76.  65.  69.  60.  80.  54. 208. 155. 112.  92. 145.
 137. 158. 167.  94. 107. 230.  49.  75.  91. 122.  67.  83.  78.  52.
  61.  93. 148. 129.  96.  71.  98. 115.  53.  81.  79. 120. 152. 102.
 108.  68.  58. 149.  89.  63.  48.  66. 139. 103. 125. 133. 138. 135.
 142.  77.  62. 132.  84.  64.  74. 116.  82.]

#### 카테고리형 데이터

In [33]:
print(df['origin'].unique()) # 자동차의 제조 국가 또는 출시국가를 나타내는 열

[1 3 2]

In [34]:
df['origin'].replace({1:'USA',2:'EU', 3:'JAPAN'},inplace=True)
print(df['origin'].unique())
print(df['origin'].dtypes) # object는 문자열 데이터

['USA' 'JAPAN' 'EU']
object

In [35]:
df['origin'] = df['origin'].astype('category') # 타입을 category로 변환
print(df['origin'].dtypes) # category는 범주형 데이터 ex) 남자, 여자 -> 범주형 데이터
                            #여기서 origin은 USA,EU,JAPAN이 범주형 데이터

category

In [36]:
print(df['model year'].sample(3))       # .sample(n) : 임의의 행을 n개 반환
df['model year'] = df['model year'].astype('category')   # 모델 연도 -> 범주형 데이터로 변환
print(df['model year'].sample(3))

232    77
367    82
241    77
Name: model year, dtype: int64
153    75
193    76
14     70
Name: model year, dtype: category
Categories (13, int64): [70, 71, 72, 73, ..., 79, 80, 81, 82]

## 01_4. 범주형(카테고리) 데이터

### 구간 분할 binning

In [37]:
import pandas as pd
df = pd.read_csv('/Users/choejong-gyu/Documents/05.데이터분석/data1/auto-mpg.csv',header=None)

# 칼럼 이름 지정
df.columns = ['mpg','cylinders','displacement','horsepower','weight','acceleration','model year','origin','name']
print(df.head(3))
print('\n')

# horsepower 열에 누락 데이터 '?' 우선 삭제
import numpy as np

df['horsepower'].replace('?',np.nan,inplace=True)
df.dropna(subset=['horsepower'],axis=0,inplace=True)
df['horsepower'] = df['horsepower'].astype('float')     # .astype('자료형 명칭')

print(df['horsepower'].dtypes)

    mpg  cylinders  displacement horsepower  weight  acceleration  model year  \
0  18.0          8         307.0      130.0  3504.0          12.0          70
1  15.0          8         350.0      165.0  3693.0          11.5          70
2  18.0          8         318.0      150.0  3436.0          11.0          70

   origin                       name
0       1  chevrolet chevelle malibu
1       1          buick skylark 320
2       1         plymouth satellite


float64

#### 구간 분할을 위한 경계선 설정값 찾기

In [38]:
# count : 구간에 속하는 데이터의 수
# bin_dividers : 구간을 나누는 경곗값
# 경계선을 나눌 값들만 찾아낸 거임

count, bin_dividers = np.histogram(df['horsepower'],bins=3)     # bins=n : 구간 개수 n, n등분 ex) bins=3 은 3개의 구간
print(count,bin_dividers) # 46~107의 구간에서는 257개 데이터가 있고
                          # 107.3 ~ 168의 구간에서는 103개의 데이터가 있고
                          # 168~230 의 구간에서는 32의 데이터가 있음.

[257 103  32] [ 46.         107.33333333 168.66666667 230.        ]

#### .cut() : 실제로 분할
속성 x = , bins = , labels = , include_lowest=

In [39]:
# .cut() : 실제로 분할해서 변수에 저장
bin_names=['저출력','보통출력','고출력']
df['hp_bin'] = pd.cut(x=df['horsepower'],       # 데이터 배열
                      bins=bin_dividers,        # 경계 값 리스트
                      labels = bin_names,       # bin 이름
                      include_lowest=True)      # 첫 경계값 포함(True), False로 지정하면 왼쪽 경계값 포함 x
                                                # 

print(df[['horsepower','hp_bin']].sample(15))   # 분할되어서 카테고리로 나누어졌는지 확인

     horsepower hp_bin
383        67.0    저출력
174        97.0    저출력
219        96.0    저출력
89        150.0   보통출력
125        95.0    저출력
68        155.0   보통출력
66        150.0   보통출력
270        95.0    저출력
214       130.0   보통출력
189       120.0   보통출력
215       150.0   보통출력
311        70.0    저출력
50         90.0    저출력
348        62.0    저출력
251       139.0   보통출력

In [40]:
df['hp_bin'].head(15) #Categories (3, object): ['저출력' < '보통출력' < '고출력']일때 고출력0,보통1,저출력2

0     보통출력
1     보통출력
2     보통출력
3     보통출력
4     보통출력
5      고출력
6      고출력
7      고출력
8      고출력
9      고출력
10     고출력
11    보통출력
12    보통출력
13     고출력
14     저출력
Name: hp_bin, dtype: category
Categories (3, object): ['저출력' < '보통출력' < '고출력']

### One-Hot Encoding

** 데이터 인코딩의 종류
1. 레이블 인코딩 label encoding
: 카테고리 항목을 뽑아 숫자로 라벨링
-> 문제점: 숫자 가중치가 생김 

2. 원핫인코딩 One-Hot encoding
: 카테고리 항목을 뽑아 2차원 데이터(희소행렬)로 만들어 포지션 표시
-> 저장공간 낭비 문제를 해결하기 위해 인베이딩 압축이라는 게 있다

In [41]:
from sklearn import preprocessing

#전처리를 위한 encounter 객체 만들기
label_encoder = preprocessing.LabelEncoder()
onehot_encoder = preprocessing.OneHotEncoder() # 범주형 데이터를 바이너리 형태로 변환 -> 머신러닝모델에 적용하는 방법

#label encoder로 카테고리형 데이터를 숫자형 범주로 변환
onehot_labeled = label_encoder.fit_transform(df['hp_bin'].head(15)) # 저출력 보통출력 고출력을 매핑한거
print(onehot_labeled)                                               # 저출력 2,보통출력1,고출력0
print(type(onehot_labeled))

[1 1 1 1 1 0 0 0 0 0 0 1 1 0 2]
<class 'numpy.ndarray'>

In [42]:
# OneHotEncoder 의 예제 범주형 데이터를 바이너리 형태로 변환 -> 머신러닝모델에 적용하는 방법

from sklearn.preprocessing import OneHotEncoder

# OneHotEncoder 객체 생성
onehot_encoder = OneHotEncoder()

# 학습 데이터에 맞추기
onehot_encoder.fit([[0], [1], [2]])

# 변환
transformed_data = onehot_encoder.transform([[1], [0], [2]]).toarray()

print(transformed_data)
# 출력: 
# [[0. 1. 0.]  # '보통출력'이면 1, 나머지는 0
#  [1. 0. 0.]  # '고출력'이면 1, 나머지는 0
#  [0. 0. 1.]]  # '저출력'이면 1, 나머지는 0

[[0. 1. 0.]
 [1. 0. 0.]
 [0. 0. 1.]]

In [43]:
#preprocessing.LabelEncoder() 의 예제

from sklearn import preprocessing

# 예시 데이터
categories = ['강아지', '고양이', '햄스터', '강아지', '고양이']

# LabelEncoder 객체 생성, 범주형 데이터를 숫자로 변환하는데 사용
label_encoder = preprocessing.LabelEncoder()

# 레이블 인코딩 수행
encoded_categories = label_encoder.fit_transform(categories)

print(encoded_categories)
# 강아지는 0, 고양이는 1, 햄스터는 2 => 강아지가 처음 나왔으므로 0번, 고양이-> 1번 , 햄스터가 마지막에 나와서 2번으로 매핑

[0 1 2 0 1]

In [44]:
# 2차원 행렬로 형태 변경
onehot_reshaped = onehot_labeled.reshape(len(onehot_labeled),1) # len을 통해 onehot_labeled의 길이를 구하고
                                                                # '1': 각 행에 하나의 열을 갖는 2차원 배열을 만들기위해 지정
print(onehot_reshaped) # 세로로 길게 쌓은 2차원 배열이 됨
print(type(onehot_reshaped))

[[1]
 [1]
 [1]
 [1]
 [1]
 [0]
 [0]
 [0]
 [0]
 [0]
 [0]
 [1]
 [1]
 [0]
 [2]]
<class 'numpy.ndarray'>

In [45]:
# 희소행렬 변환
onehot_fitted = onehot_encoder.fit_transform(onehot_reshaped)
print(onehot_fitted)
print(type(onehot_fitted))

  (0, 1)	1.0
  (1, 1)	1.0
  (2, 1)	1.0
  (3, 1)	1.0
  (4, 1)	1.0
  (5, 0)	1.0
  (6, 0)	1.0
  (7, 0)	1.0
  (8, 0)	1.0
  (9, 0)	1.0
  (10, 0)	1.0
  (11, 1)	1.0
  (12, 1)	1.0
  (13, 0)	1.0
  (14, 2)	1.0
<class 'scipy.sparse._csr.csr_matrix'>

### 더미 함수

In [46]:
# .get_dummies() : 더미 함수, 범주형 데이터를 원-핫 인코딩하여 더미변수로 변환 , 각범주를 새로운 열로 확장하여 0 or 1의 이진값
horsepower_dummies = pd.get_dummies(df['hp_bin'])
print(horsepower_dummies.head(15))


# False 부문이 더미변수이고 True는 해당하는 범주에 값이 속한다는 뜻

      저출력   보통출력    고출력
0   False   True  False
1   False   True  False
2   False   True  False
3   False   True  False
4   False   True  False
5   False  False   True
6   False  False   True
7   False  False   True
8   False  False   True
9   False  False   True
10  False  False   True
11  False   True  False
12  False   True  False
13  False  False   True
14   True  False  False

## 01_5. 데이터 정규화

### 방법 1. 해당 열의 최대값(절대값)으로 나누는 방법

In [47]:
print(df.horsepower.describe()) # describe 함수를 사용하면 count,mean,std,min,25%,50%,75%,max 값을 알려줌
print()                         # 25%는 데이터의 크기순으로 나눴을때 1/4 지점에 위치한 값
                                # 75%는 데이터의 크기순으로 나눴을때 3/4 지점에 위치한 값
                                # std : 표준편차: 분포가 얼마나 퍼져있는지 나타내는 지표, 값이 작을수록 평균에 가깝다는뜻
df.horsepower = df.horsepower / abs(df.horsepower.max())

print(df.horsepower.head())
print()
print(df.horsepower.describe())

count    392.000000
mean     104.469388
std       38.491160
min       46.000000
25%       75.000000
50%       93.500000
75%      126.000000
max      230.000000
Name: horsepower, dtype: float64

0    0.565217
1    0.717391
2    0.652174
3    0.652174
4    0.608696
Name: horsepower, dtype: float64

count    392.000000
mean       0.454215
std        0.167353
min        0.200000
25%        0.326087
50%        0.406522
75%        0.547826
max        1.000000
Name: horsepower, dtype: float64

### 방법 2. 최대값(max) - 최소값(min)으로 나누기

In [48]:
import pandas as pd
df = pd.read_csv('/Users/choejong-gyu/Documents/05.데이터분석/data1/auto-mpg.csv',header=None)

# 칼럼 이름 지정
df.columns = ['mpg','cylinders','displacement','horsepower','weight','acceleration','model year','origin','name']

# horsepower 열에 누락 데이터 '?' 우선 삭제
import numpy as np

df['horsepower'].replace('?',np.nan,inplace=True)
df.dropna(subset=['horsepower'],axis=0,inplace=True)
df['horsepower'] = df['horsepower'].astype('float')     # .astype 으로 float형으로 변환

print(df['horsepower'].dtypes) # horsepower의 타입
print(df.horsepower.describe()) # 설명
print()


# 데이터 정규화 : (각데이터-최소값)/(최대값-최소값) 을 하면 0~1 사이의 값으로 정규화됨
# 데이터 정규화를 하는 이유: 모델 성능 향상, 이상치 최소화, 모델의 안정성과 성능 향상
min_x = df.horsepower - df.horsepower.min() 
min_max = df.horsepower.max() - df.horsepower.min()
df.horsepower = min_x / min_max

print(df.horsepower.head())
print()
print(df.horsepower.describe())

float64
count    392.000000
mean     104.469388
std       38.491160
min       46.000000
25%       75.000000
50%       93.500000
75%      126.000000
max      230.000000
Name: horsepower, dtype: float64

0    0.456522
1    0.646739
2    0.565217
3    0.565217
4    0.510870
Name: horsepower, dtype: float64

count    392.000000
mean       0.317768
std        0.209191
min        0.000000
25%        0.157609
50%        0.258152
75%        0.434783
max        1.000000
Name: horsepower, dtype: float64

## 01_6. 시계열 데이터(time series data)

### 다른 자료형을 시계열 객체로 변환하기

#### pd.to_datetime(변환할변수이름) :문자열 to timestamp

In [49]:
# 주식 거래 관련 데이터
import pandas as pd
df = pd.read_csv('/Users/choejong-gyu/Documents/05.데이터분석/data1/stock-data.csv')
print(df.head())
print('\n')
print(df.info())

         Date  Close  Start   High    Low  Volume
0  2018-07-02  10100  10850  10900  10000  137977
1  2018-06-29  10700  10550  10900   9990  170253
2  2018-06-28  10400  10900  10950  10150  155769
3  2018-06-27  10900  10800  11050  10500  133548
4  2018-06-26  10800  10900  11000  10700   63039


<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    20 non-null     object
 1   Close   20 non-null     int64
 2   Start   20 non-null     int64
 3   High    20 non-null     int64
 4   Low     20 non-null     int64
 5   Volume  20 non-null     int64
dtypes: int64(5), object(1)
memory usage: 1.1+ KB
None

In [50]:
# 문자열 데이터 -> 판다스 timestamp 변환, timestamp -> 시계열 데이터를 다루기 위해 사용
df['new_Date'] = pd.to_datetime(df['Date'])

print(df.head())
print()
print(df.info())
print()
print(type(df['new_Date'][0]))

         Date  Close  Start   High    Low  Volume   new_Date
0  2018-07-02  10100  10850  10900  10000  137977 2018-07-02
1  2018-06-29  10700  10550  10900   9990  170253 2018-06-29
2  2018-06-28  10400  10900  10950  10150  155769 2018-06-28
3  2018-06-27  10900  10800  11050  10500  133548 2018-06-27
4  2018-06-26  10800  10900  11000  10700   63039 2018-06-26

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Date      20 non-null     object
 1   Close     20 non-null     int64
 2   Start     20 non-null     int64
 3   High      20 non-null     int64
 4   Low       20 non-null     int64
 5   Volume    20 non-null     int64
 6   new_Date  20 non-null     datetime64[ns]
dtypes: datetime64[ns](1), int64(5), object(1)
memory usage: 1.2+ KB
None

<class 'pandas._libs.tslibs.timestamps.Timestamp'>

In [51]:
# 변환했으니 필요한 데이터만 남기기
df.set_index('new_Date',inplace=True)
df.drop('Date',axis=1,inplace=True)

print(df.head())
print()
print(df.info())

            Close  Start   High    Low  Volume
new_Date
2018-07-02  10100  10850  10900  10000  137977
2018-06-29  10700  10550  10900   9990  170253
2018-06-28  10400  10900  10950  10150  155769
2018-06-27  10900  10800  11050  10500  133548
2018-06-26  10800  10900  11000  10700   63039

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 20 entries, 2018-07-02 to 2018-06-01
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Close   20 non-null     int64
 1   Start   20 non-null     int64
 2   High    20 non-null     int64
 3   Low     20 non-null     int64
 4   Volume  20 non-null     int64
dtypes: int64(5)
memory usage: 960.0 bytes
None

#### to_period(freq ='자를 단위'): timestamp to period
표기 단위 = { Y : 연 단위, M : 월 단위, D : 일 단위}

In [52]:
import pandas as pd

dates = ['2019-01-01','2020-03-01','2021-06-01']
ts_dates = pd.to_datetime(dates)            # 문자열 -> timestamp
print(ts_dates)

pr_day = ts_dates.to_period(freq='D')       # 일 단위까지 변환
print(pr_day)

pr_month = ts_dates.to_period(freq='M')     # 월 단위까지 자르기
print(pr_month)

pr_year = ts_dates.to_period(freq='Y')      # 연 단위까지 자르기
print(pr_year)

# pr_year = ts_dates.to_period()            # period 함수 안에 단위 안 넣어주면 에러 남
# print(pr_year)

DatetimeIndex(['2019-01-01', '2020-03-01', '2021-06-01'], dtype='datetime64[ns]', freq=None)
PeriodIndex(['2019-01-01', '2020-03-01', '2021-06-01'], dtype='period[D]')
PeriodIndex(['2019-01', '2020-03', '2021-06'], dtype='period[M]')
PeriodIndex(['2019', '2020', '2021'], dtype='period[A-DEC]')

### 시계열 데이터 만들기

#### .date_range() : timestamp 배열
속성들: freq=시간 간격, tz= 시간대, start=날짜 범위 시작점(선택 안 하면 월의 마지막 날이 디폴트)

In [53]:
import pandas as pd


# 월 간격, 월의 시작일 기준
ts_ms = pd.date_range(start='2019-01-01',   # 날짜 범위 시작
                      end=None,             # 날짜 범위 끝
                      periods=6,            # 생성할 타임스탬프 개수
                      freq='MS',            # 시간 간격(MS: month start)
                      tz='Asia/Seoul')      # 시간대(timezone)

print(ts_ms)
print('\n')


# 월 간격, 월의 마지막 날 기준
ts_me = pd.date_range('2019-01-01',         # 날짜 범위 시작
                      periods=6,            # 생성할 타임스탬프 개수
                      freq='M',             # 시간 간격(MS: month start)
                      tz='Asia/Seoul')      # 시간대(timezone)

print(ts_me)
print('\n')




# 분기(3개월) 간격, 월의 마지막 날 기준
ts_3m = pd.date_range('2019-01-01',         # 날짜 범위 시작
                      periods=6,            # 생성할 타임스탬프 개수
                      freq='3M',            # 시간 간격(3M : 3 months)
                      tz='Asia/Seoul')      # 시간대(timezone)

print(ts_3m)
print('\n')

DatetimeIndex(['2019-01-01 00:00:00+09:00', '2019-02-01 00:00:00+09:00',
               '2019-03-01 00:00:00+09:00', '2019-04-01 00:00:00+09:00',
               '2019-05-01 00:00:00+09:00', '2019-06-01 00:00:00+09:00'],
              dtype='datetime64[ns, Asia/Seoul]', freq='MS')


DatetimeIndex(['2019-01-31 00:00:00+09:00', '2019-02-28 00:00:00+09:00',
               '2019-03-31 00:00:00+09:00', '2019-04-30 00:00:00+09:00',
               '2019-05-31 00:00:00+09:00', '2019-06-30 00:00:00+09:00'],
              dtype='datetime64[ns, Asia/Seoul]', freq='M')


DatetimeIndex(['2019-01-31 00:00:00+09:00', '2019-04-30 00:00:00+09:00',
               '2019-07-31 00:00:00+09:00', '2019-10-31 00:00:00+09:00',
               '2020-01-31 00:00:00+09:00', '2020-04-30 00:00:00+09:00'],
              dtype='datetime64[ns, Asia/Seoul]', freq='3M')

#### .period_range() : period 배열

In [54]:
# period 배열 만들기 - 1개월 길이
pr_m = pd.period_range(start='2019-01-01',      # 날짜 범위 시작
                       end=None,                # 날짜 범위 끝
                       periods=3,               # 생성할 period 개수
                       freq='M')                # 기간 길이(H: 시간)
print(pr_m)
print('\n')

PeriodIndex(['2019-01', '2019-02', '2019-03'], dtype='period[M]')

In [55]:
# period 배열 만들기 - 1시간 길이
pr_h = pd.period_range(start='1998-10-25',      # 날짜 범위 시작
                       end=None,                # 날짜 범위 끝
                       periods=24,              # 생성할 period 개수
                       freq='H')                # 기간 길이(H: 시간)
print(pr_h)
print('\n')

PeriodIndex(['1998-10-25 00:00', '1998-10-25 01:00', '1998-10-25 02:00',
             '1998-10-25 03:00', '1998-10-25 04:00', '1998-10-25 05:00',
             '1998-10-25 06:00', '1998-10-25 07:00', '1998-10-25 08:00',
             '1998-10-25 09:00', '1998-10-25 10:00', '1998-10-25 11:00',
             '1998-10-25 12:00', '1998-10-25 13:00', '1998-10-25 14:00',
             '1998-10-25 15:00', '1998-10-25 16:00', '1998-10-25 17:00',
             '1998-10-25 18:00', '1998-10-25 19:00', '1998-10-25 20:00',
             '1998-10-25 21:00', '1998-10-25 22:00', '1998-10-25 23:00'],
            dtype='period[H]')

In [56]:
# period 배열 만들기 - 2시간 길이
pr_2h = pd.period_range(start='1998-10-25 10:25',      # 날짜 범위 시작
                       end=None,                       # 날짜 범위 끝
                       periods=3,                      # 생성할 period 개수
                       freq='2H')                      # 기간 길이(H: 시간)
print(pr_2h)
print('\n')

PeriodIndex(['1998-10-25 10:00', '1998-10-25 12:00', '1998-10-25 14:00'], dtype='period[2H]')

### 시계열 데이터 활용

#### 날짜 데이터 분리

In [57]:
import pandas as pd

df = pd.read_csv('./00.data/data_1/stock-data.csv')

# 문자열인 날짜 데이터를 판다스 timestamp로 변환
df['new_Date'] = pd.to_datetime(df['Date'])
print(df.head())
print('\n')

df['Year'] = df['new_Date'].dt.year
df['Month'] = df['new_Date'].dt.month
df['Day'] = df['new_Date'].dt.day
print(df.head())
print('\n')

FileNotFoundError: [Errno 2] No such file or directory: './00.data/data_1/stock-data.csv'

In [ ]:
# timestamp를 period로 변환

df['Date_yr'] = df['new_Date'].dt.to_period(freq='A')
df['Date_m'] = df['new_Date'].dt.to_period(freq='M')
print(df.head())
print('\n')

print(df['Date_yr'].dtype)
print(df['Date_m'].dtype)

         Date  Close  Start   High    Low  Volume   new_Date  Year  Month  \
0  2018-07-02  10100  10850  10900  10000  137977 2018-07-02  2018      7
1  2018-06-29  10700  10550  10900   9990  170253 2018-06-29  2018      6
2  2018-06-28  10400  10900  10950  10150  155769 2018-06-28  2018      6
3  2018-06-27  10900  10800  11050  10500  133548 2018-06-27  2018      6
4  2018-06-26  10800  10900  11000  10700   63039 2018-06-26  2018      6

   Day Date_yr   Date_m
0    2    2018  2018-07
1   29    2018  2018-06
2   28    2018  2018-06
3   27    2018  2018-06
4   26    2018  2018-06


period[A-DEC]
period[M]

#### 날짜 데이터별 추출

In [ ]:
# 날짜 추출 후 인덱스 설정

df.set_index('Date_m',inplace=True)
print(df.head())

               Date  Close  Start   High    Low  Volume   new_Date  Year  \
Date_m
2018-07  2018-07-02  10100  10850  10900  10000  137977 2018-07-02  2018
2018-06  2018-06-29  10700  10550  10900   9990  170253 2018-06-29  2018
2018-06  2018-06-28  10400  10900  10950  10150  155769 2018-06-28  2018
2018-06  2018-06-27  10900  10800  11050  10500  133548 2018-06-27  2018
2018-06  2018-06-26  10800  10900  11000  10700   63039 2018-06-26  2018

         Month  Day Date_yr
Date_m
2018-07      7    2    2018
2018-06      6   29    2018
2018-06      6   28    2018
2018-06      6   27    2018
2018-06      6   26    2018

# 11월 21일

# 02.데이터프레임의 다양한 사용법

## 02_1. 함수 매핑

In [ ]:
# 데이터 준비

import seaborn as sns

titanic = sns.load_dataset('titanic')
df = titanic.loc[:,['age','fare']]
df['ten'] = 10
print(df.head())

    age     fare  ten
0  22.0   7.2500   10
1  38.0  71.2833   10
2  26.0   7.9250   10
3  35.0  53.1000   10
4  35.0   8.0500   10

### 개별 원소에 함수 매핑

#### .apply() :시리즈 안의 개별 원소에 특정 함수 매핑

In [ ]:
# 사용자 함수 정의

def add_10(n):
    return n + 10

def add_two_obj(a,b):
    return a + b

print(add_10(10))
print(add_two_obj(10,10))
print('\n')

20
20

In [ ]:
# [어떤 시리즈].apply(함수) : 어떤 시리즈에 속한 값(원소)들이 함수에 들어가게 됨, 결과는 또 다른 시리즈로 
sr1 = df['age'].apply(add_10)

print(df['age'].head(),sr1.head())

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: age, dtype: float64 0    32.0
1    48.0
2    36.0
3    45.0
4    45.0
Name: age, dtype: float64

In [ ]:
# 시리즈 객체와 숫자에 적용 : 2개의 인수(시리즈 + 숫자)에 적용하기

print(df.head())

sr2 = df['age'].apply(add_two_obj,b=10)
print(sr2.head())

    age     fare  ten
0  22.0   7.2500   10
1  38.0  71.2833   10
2  26.0   7.9250   10
3  35.0  53.1000   10
4  35.0   8.0500   10
0    32.0
1    48.0
2    36.0
3    45.0
4    45.0
Name: age, dtype: float64

In [ ]:
sr2

0      32.0
1      48.0
2      36.0
3      45.0
4      45.0
       ...
886    37.0
887    29.0
888     NaN
889    36.0
890    42.0
Name: age, Length: 891, dtype: float64

#### .lambda() : 활용도가 매우 무궁무진한데 이렇게도 활용할 수 있음

In [ ]:
# .lambda(): 시리즈 객체에 적용
sr3 = df['age'].apply(lambda x : add_10(x))     # x가 시리즈 안의 원소를 뜻함
print(sr3.head())

0    32.0
1    48.0
2    36.0
3    45.0
4    45.0
Name: age, dtype: float64

#### .applymap() : 데이터프레임 안의 모든 시리즈가 가진 원소 각각에 특정 함수 매핑

In [ ]:
# 데이터 준비

import seaborn as sns

titanic = sns.load_dataset('titanic')
df = titanic.loc[:,['age','fare']]
df['ten'] = 10
print(df.head())

def add_10(n):
    return n + 10

def add_two_obj(a,b):
    return a + b

    age     fare  ten
0  22.0   7.2500   10
1  38.0  71.2833   10
2  26.0   7.9250   10
3  35.0  53.1000   10
4  35.0   8.0500   10

In [ ]:
df_map = df.applymap(add_10)  # 데이터프레임의 모든 원소에 add_10 적용
print(df_map.head())

    age     fare  ten
0  32.0  17.2500   20
1  48.0  81.2833   20
2  36.0  17.9250   20
3  45.0  63.1000   20
4  45.0  18.0500   20

### 시리즈 객체에 함수 매핑

#### .apply(함수,axis=0): 데이터 프레임의 각 열에 함수 매핑
-> 함수에 column 시리즈 입력, column이 모인 시리즈 리턴 = 데이터프레임

In [ ]:
# 데이터 준비

import seaborn as sns

titanic = sns.load_dataset('titanic')
df = titanic.loc[:,['age','fare']]
df['ten'] = 10
print(df.head())

# 사용자 함수 정의
def missing_value(series):      # null이 있는지 확인하는 함수
    return series.isnull()      # insull에 들어갔다 나온 불린 시리즈를 반환

    age     fare  ten
0  22.0   7.2500   10
1  38.0  71.2833   10
2  26.0   7.9250   10
3  35.0  53.1000   10
4  35.0   8.0500   10

In [ ]:
result = df.apply(missing_value, axis=0)
print(result.head())
print()
print(type(result))

     age   fare    ten
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False

<class 'pandas.core.frame.DataFrame'>

#### .apply(M:1 함수): 데이터프레임에 적용하고 결과물은 시리즈로 나옴
-> 함수 자체가 여러 값을 받아 하나만 리턴하는 경우

In [ ]:
def min_max(x):
    return x.max() - x.min()

result = df.apply(min_max)
print(result)
print()
print(type(result))

age      79.5800
fare    512.3292
ten       0.0000
dtype: float64

<class 'pandas.core.series.Series'>

#### .apply(람다함수 변수: 함수2(변수할당),axis=1): 데이터 프레임의 각 행에 함수 매핑 
-> 함수에 row가 모인 시리즈 입력, row 결과값이 모인 시리즈 리턴

In [ ]:
# 데이터 준비

import seaborn as sns

titanic = sns.load_dataset('titanic')
df = titanic.loc[:,['age','fare']]
df['ten'] = 10
print(df.head())

# 사용자 함수 정의
def add_two_obj(a,b):
    return a + b

df['add'] = df.apply(lambda x : add_two_obj(x['age'],x['ten']),axis=1)
print(df.head())

    age     fare  ten
0  22.0   7.2500   10
1  38.0  71.2833   10
2  26.0   7.9250   10
3  35.0  53.1000   10
4  35.0   8.0500   10
    age     fare  ten   add
0  22.0   7.2500   10  32.0
1  38.0  71.2833   10  48.0
2  26.0   7.9250   10  36.0
3  35.0  53.1000   10  45.0
4  35.0   8.0500   10  45.0

### .pipe() : 데이터프레임 객체에 함수 매핑

In [ ]:
# 데이터 준비

import seaborn as sns

titanic = sns.load_dataset('titanic')
df = titanic.loc[:,['age','fare']]


# 사용자 함수 정의 
def missing_value(x):               # 결과물 -> DataFrame
    return x.isnull()

def missing_count(x):               # 결과물 -> Series
    return missing_value(x).sum()

def total_number_missing(x):        # 결과물 -> value
    return missing_count(x).sum()

In [ ]:
result_df = df.pipe(missing_value)
print(result_df.sample(10))
print(type(result_df))

       age   fare
722  False  False
742  False  False
85   False  False
830  False  False
696  False  False
782  False  False
332  False  False
726  False  False
736  False  False
741  False  False
<class 'pandas.core.frame.DataFrame'>

In [ ]:
result_series = df.pipe(missing_count)
print(result_series)
print(type(result_series))

age     177
fare      0
dtype: int64
<class 'pandas.core.series.Series'>

In [ ]:
result_value = df.pipe(total_number_missing)
print(result_value)
print(type(result_value))

177
<class 'numpy.int64'>

In [ ]:
# 쟈근 실험

# test_result = df.pipe(df.pipe(df.pipe(missing_value)))
# print(test_result)
# print(type(test_result))

TypeError: 'DataFrame' object is not callable

## 02_2. 열 재구성

### 열 순서 바꾸기

In [ ]:
# 데이터 준비
import seaborn as sns

titanic = sns.load_dataset('titanic')
df = titanic.loc[0:4,'survived':'age']
print(df.head())

   survived  pclass     sex   age
0         0       3    male  22.0
1         1       1  female  38.0
2         1       3  female  26.0
3         1       1  female  35.0
4         0       3    male  35.0

In [ ]:
# 열 이름 리스트 만들기
columns = list(df.columns.values)
print(columns,'\n')

['survived', 'pclass', 'sex', 'age']

In [ ]:
# 열 이름 알파벳 순으로 정렬 - 내가 생각한 것 ^^
columns.sort()
print(columns)

['age', 'pclass', 'sex', 'survived']

In [ ]:
# sorted() : 열 이름 알파벳 순으로 정렬 - pd 내장함수
columns_sorted = sorted(columns)
df_sorted = df[columns_sorted]
print(df_sorted,'\n')

    age  pclass     sex  survived
0  22.0       3    male         0
1  38.0       1  female         1
2  26.0       3  female         1
3  35.0       1  female         1
4  35.0       3    male         0

In [ ]:
# reversed() : 열 이름 역순으로 정렬 - pd 내장함수
columns_reversed = reversed(columns)
df_reversed = df[columns_reversed]
print(df_reversed,'\n')

    age     sex  pclass  survived
0  22.0    male       3         0
1  38.0  female       1         1
2  26.0  female       3         1
3  35.0  female       1         1
4  35.0    male       3         0

In [ ]:
# 열 이름 사용자 임의 지정
columns_custom = ['pclass','sex','age','survived']
df_custom = df[columns_custom]
print(df_custom)

   pclass     sex   age  survived
0       3    male  22.0         0
1       1  female  38.0         1
2       3  female  26.0         1
3       1  female  35.0         1
4       3    male  35.0         0

### 열 분리하기

In [ ]:
# 데이터 준비

import pandas as pd

df = pd.read_excel('/Users/choejong-gyu/Documents/05.데이터분석/data1/주가데이터.xlsx')
print(df.head(),'\n')
print(df.dtypes)

         연월일   당일종가  전일종가     시가     고가     저가     거래량
0 2018-07-02  10100   600  10850  10900  10000  137977
1 2018-06-29  10700   300  10550  10900   9990  170253
2 2018-06-28  10400   500  10900  10950  10150  155769
3 2018-06-27  10900   100  10800  11050  10500  133548
4 2018-06-26  10800   350  10900  11000  10700   63039

연월일     datetime64[ns]
당일종가             int64
전일종가             int64
시가               int64
고가               int64
저가               int64
거래량              int64
dtype: object

In [ ]:
df['연원일'] = df['연월일'].astype('str')
dates = df['연원일'].str.split('-')
print(dates)

0     [2018, 07, 02]
1     [2018, 06, 29]
2     [2018, 06, 28]
3     [2018, 06, 27]
4     [2018, 06, 26]
5     [2018, 06, 25]
6     [2018, 06, 22]
7     [2018, 06, 21]
8     [2018, 06, 20]
9     [2018, 06, 19]
10    [2018, 06, 18]
11    [2018, 06, 15]
12    [2018, 06, 14]
13    [2018, 06, 12]
14    [2018, 06, 11]
15    [2018, 06, 08]
16    [2018, 06, 07]
17    [2018, 06, 05]
18    [2018, 06, 04]
19    [2018, 06, 01]
Name: 연원일, dtype: object

In [ ]:
# dates의 데이터 타입 확인하기
print(type(dates))
# print(type(dates[0][0]))

<class 'list'>

In [ ]:
df['연'] = dates.str.get(0)
df['월'] = dates.str.get(1)
df['일'] = dates.str.get(2)
print(df['연'].head(),'\n')
print(df['월'].head(),'\n')
print(df['일'].head(),'\n')

print(df.head())

0    2018
1    2018
2    2018
3    2018
4    2018
Name: 연, dtype: object

0    07
1    06
2    06
3    06
4    06
Name: 월, dtype: object

0    02
1    29
2    28
3    27
4    26
Name: 일, dtype: object

         연월일   당일종가  전일종가     시가     고가     저가     거래량     연   월   일
0 2018-07-02  10100   600  10850  10900  10000  137977  2018  07  02
1 2018-06-29  10700   300  10550  10900   9990  170253  2018  06  29
2 2018-06-28  10400   500  10900  10950  10150  155769  2018  06  28
3 2018-06-27  10900   100  10800  11050  10500  133548  2018  06  27
4 2018-06-26  10800   350  10900  11000  10700   63039  2018  06  26

## 02_3. 필터링

### 불린 인덱싱 ** mask연산(True or False 반환) 활용

#### 미션 : mask 연산 이해하기
1. 십대인 승객 선택하기
2. 10세 미만이고 여성인 승객 선택하기
3. 10세 미만 또는 60세 이상인 승객의 age, sex, alone 열만 선택

In [ ]:
# 데이터 준비

import seaborn as sns

titanic = sns.load_dataset('titanic')
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

##### with 교수님

In [ ]:
# 1. 십대인 승객 선택하기
mask1 = (titanic.age >= 10) & (titanic.age < 20)
df_teen = titanic.loc[mask1,:]
print(df_teen.sample(10),'\n')

     survived  pclass     sex   age  sibsp  parch      fare embarked   class  \
86          0       3    male  16.0      1      3   34.3750        S   Third
138         0       3    male  16.0      0      0    9.2167        S   Third
389         1       2  female  17.0      0      0   12.0000        C  Second
144         0       2    male  18.0      0      0   11.5000        S  Second
307         1       1  female  17.0      1      0  108.9000        C   First
887         1       1  female  19.0      0      0   30.0000        S   First
39          1       3  female  14.0      1      0   11.2417        C   Third
372         0       3    male  19.0      0      0    8.0500        S   Third
67          0       3    male  19.0      0      0    8.1583        S   Third
504         1       1  female  16.0      0      0   86.5000        S   First

       who  adult_male deck  embark_town alive  alone  teens
86     man        True  NaN  Southampton    no  False   16.0
138    man        True  NaN  Southampton    no   True   16.0
389  woman       False  NaN    Cherbourg   yes   True   17.0
144    man        True  NaN  Southampton    no   True   18.0
307  woman       False    C    Cherbourg   yes  False   17.0
887  woman       False    B  Southampton   yes   True   19.0
39   child       False  NaN    Cherbourg   yes  False   14.0
372    man        True  NaN  Southampton    no   True   19.0
67     man        True  NaN  Southampton    no   True   19.0
504  woman       False    B  Southampton   yes   True   16.0

In [ ]:
# 2. 십세 미만이고 여성인 승객 선택하기
mask2 = (titanic.age < 10) & (titanic.sex == 'female')
df_girls = titanic.loc[mask2,:]
print(df_girls.sample(10),'\n')

     survived  pclass     sex  age  sibsp  parch     fare embarked   class  \
852         0       3  female  9.0      1      1  15.2458        C   Third
535         1       2  female  7.0      0      2  26.2500        S  Second
541         0       3  female  9.0      4      2  31.2750        S   Third
530         1       2  female  2.0      1      1  26.0000        S  Second
10          1       3  female  4.0      1      1  16.7000        S   Third
43          1       2  female  3.0      1      2  41.5792        C  Second
813         0       3  female  6.0      4      2  31.2750        S   Third
184         1       3  female  4.0      0      2  22.0250        S   Third
237         1       2  female  8.0      0      2  26.2500        S  Second
642         0       3  female  2.0      3      2  27.9000        S   Third

       who  adult_male deck  embark_town alive  alone  teens
852  child       False  NaN    Cherbourg    no  False    9.0
535  child       False  NaN  Southampton   yes  False    7.0
541  child       False  NaN  Southampton    no  False    9.0
530  child       False  NaN  Southampton   yes  False    2.0
10   child       False    G  Southampton   yes  False    4.0
43   child       False  NaN    Cherbourg   yes  False    3.0
813  child       False  NaN  Southampton    no  False    6.0
184  child       False  NaN  Southampton   yes  False    4.0
237  child       False  NaN  Southampton   yes  False    8.0
642  child       False  NaN  Southampton    no  False    2.0

In [ ]:
# 3. 십세 미만 또는 60세 이상인 승객의 age, sex, alone 열만 선택
mask3 = (titanic.age < 10) | (titanic.age >= 60)
df_children_grannies = titanic.loc[mask3,['age','sex','alone']] # 조건에 맞는 행과 해당 행들의 age,sex,alone열 선택
print(df_children_grannies.sample(10))

      age     sex  alone
480   9.0    male  False
438  64.0    male  False
10    4.0  female  False
205   2.0  female  False
366  60.0  female  False
813   6.0  female  False
869   4.0    male  False
24    8.0  female  False
750   4.0  female  False
63    4.0    male  False

### isin() 메소드 활용

In [ ]:
# 데이터 준비

import seaborn as sns

titanic = sns.load_dataset('titanic')
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [ ]:
# 함께 탑승한 형제 또는 배우자의 수가 3,4,5인 승객만 따로 추출 - 불린 인덱싱 버전
mask_sib3 = titanic['sibsp'] == 3
mask_sib4 = titanic['sibsp'] == 4
mask_sib5 = titanic['sibsp'] == 5
df_boolean = titanic[mask_sib3|mask_sib4|mask_sib5]
print(df_boolean.sample(5))
print('\n')

# 함께 탑승한 형제 또는 배우자의 수가 3,4,5인 승객만 따로 추출 - isin() 버전

isin_filter = titanic['sibsp'].isin([3,4,5])
df_isin = titanic[isin_filter]

print(df_isin.sample(5))

     survived  pclass     sex   age  sibsp  parch     fare embarked  class  \
68          1       3  female  17.0      4      2   7.9250        S  Third
278         0       3    male   7.0      4      1  29.1250        Q  Third
480         0       3    male   9.0      5      2  46.9000        S  Third
229         0       3  female   NaN      3      1  25.4667        S  Third
485         0       3  female   NaN      3      1  25.4667        S  Third

       who  adult_male deck  embark_town alive  alone
68   woman       False  NaN  Southampton   yes  False
278  child       False  NaN   Queenstown    no  False
480  child       False  NaN  Southampton    no  False
229  woman       False  NaN  Southampton    no  False
485  woman       False  NaN  Southampton    no  False

## 02_4. 데이터프레임 합치기

In [ ]:
# 데이터 준비

import pandas as pd

df1 = pd.DataFrame({'a':['a0','a1','a2','a3'],
                    'b':['b0','b1','b2','b3'],
                    'c':['c0','c1','c2','c3']},
                   index=[0,1,2,3])

df2 = pd.DataFrame({'a':['a2','a3','a4','a5'],
                    'b':['b2','b3','b4','b5'],
                    'c':['c2','c3','c4','c5'],
                    'd':['d2','d3','d4','d5']}
                   ,index=[2,3,4,5])

print(df1,'\n')
print(df2,'\n')

    a   b   c
0  a0  b0  c0
1  a1  b1  c1
2  a2  b2  c2
3  a3  b3  c3

    a   b   c   d
2  a2  b2  c2  d2
3  a3  b3  c3  d3
4  a4  b4  c4  d4
5  a5  b5  c5  d5

### .concat(): 데이터프레임 연결
속성값들 
-> axis = 0 or 1 / ignore_index = T or F / join = ' '

#### 데이터프레임 + 데이터프레임

##### .concat(axis=0) : 행 기준으로 연결

In [ ]:
# 기본값 axis=0

result1 = pd.concat([df1,df2])  
print(result1,'\n')
# df1의 데이터 먼저 나오고 그 밑으로 df2 가 출력이 됨 df1에서 d가 없으면 NaN으로 표시

    a   b   c    d
0  a0  b0  c0  NaN
1  a1  b1  c1  NaN
2  a2  b2  c2  NaN
3  a3  b3  c3  NaN
2  a2  b2  c2   d2
3  a3  b3  c3   d3
4  a4  b4  c4   d4
5  a5  b5  c5   d5

.concat(): ignore_index=True로 설정 -> 기존 데이터프레임의 지정인덱스 모두 무시

In [ ]:
result1 = pd.concat([df1,df2],ignore_index=True)  
print(result1,'\n')


# df2의 기존에 있던 인덱스를 무시하고 새롭게 만들어짐

    a   b   c    d
0  a0  b0  c0  NaN
1  a1  b1  c1  NaN
2  a2  b2  c2  NaN
3  a3  b3  c3  NaN
4  a2  b2  c2   d2
5  a3  b3  c3   d3
6  a4  b4  c4   d4
7  a5  b5  c5   d5

.concat(,axis=1) : 칼럼 기준으로 연결

In [ ]:
result2 = pd.concat([df1,df2],axis=1)  # 열 기준으로 연결한다는 뜻 
print(result2,'\n')

     a    b    c    a    b    c    d
0   a0   b0   c0  NaN  NaN  NaN  NaN
1   a1   b1   c1  NaN  NaN  NaN  NaN
2   a2   b2   c2   a2   b2   c2   d2
3   a3   b3   c3   a3   b3   c3   d3
4  NaN  NaN  NaN   a4   b4   c4   d4
5  NaN  NaN  NaN   a5   b5   c5   d5

속성 join = 'inner': 교집합

In [ ]:
result_in = pd.concat([df1,df2],axis=1,join='inner') # 열기준으로 연결하고 inner: 교집합을 한다는 듯 
                                                     # 행 2와 행3을 교집합
print(result_in)

    a   b   c   a   b   c   d
2  a2  b2  c2  a2  b2  c2  d2
3  a3  b3  c3  a3  b3  c3  d3

#### 데이터프레임 + 시리즈 합치기

In [ ]:
# 시리즈 만들기

sr1 = pd.Series(['e0','e1','e2','e3'],name='e')
sr2 = pd.Series(['f0','f1','f2'],name='f',index=[3,4,5])
sr3 = pd.Series(['g0','g1','g2','g3'],name='g')

In [ ]:
# 좌우 열 방향으로 연결

print(df1)
print('\n')
result4 = pd.concat([df1,sr1],axis=1) # e -> sr1
print(result4)

    a   b   c
0  a0  b0  c0
1  a1  b1  c1
2  a2  b2  c2
3  a3  b3  c3


    a   b   c   e
0  a0  b0  c0  e0
1  a1  b1  c1  e1
2  a2  b2  c2  e2
3  a3  b3  c3  e3

In [ ]:
# sort = True : 열의 인덱스 기준으로 정렬
result5 = pd.concat([df2,sr2],axis=1,sort=True)
print(result5)
# a, b, c, d, f

    a   b   c   d    f
2  a2  b2  c2  d2  NaN
3  a3  b3  c3  d3   f0
4  a4  b4  c4  d4   f1
5  a5  b5  c5  d5   f2

##### 시리즈를 행 기준, 열 기준으로 concat 했을 때 달라지는 데이터타입

In [ ]:
# 칼럼 기준으로 연결 -> 데이터프레임이 됨
result6 = pd.concat([sr1,sr3],axis=1)
print(result6)
print(type(result6))

    e   g
0  e0  g0
1  e1  g1
2  e2  g2
3  e3  g3
<class 'pandas.core.frame.DataFrame'>

In [ ]:
# 행 기준으로 연결 -> 그대로 시리즈임
result7 = pd.concat([sr1,sr3],axis=0)
print(result7)
print(type(result7))

0    e0
1    e1
2    e2
3    e3
0    g0
1    g1
2    g2
3    g3
dtype: object
<class 'pandas.core.series.Series'>

### .merge(): 데이터프레임 병합
특정 기준으로 두 데이터프레임을 병합

In [ ]:
# 데이터 준비

import pandas as pd

df1 = pd.read_excel('/Users/choejong-gyu/Documents/05.데이터분석/data1/stock price.xlsx')
df2 = pd.read_excel('/Users/choejong-gyu/Documents/05.데이터분석/data1/stock valuation.xlsx')
print(df1,'\n')
print(df2,'\n')

       id stock_name          value   price
0  128940       한미약품   59385.666667  421000
1  130960     CJ E&M   58540.666667   98900
2  138250      엔에스쇼핑   14558.666667   13200
3  139480        이마트  239230.833333  254500
4  142280     녹십자엠에스     468.833333   10200
5  145990        삼양사   82750.000000   82000
6  185750        종근당   40293.666667  100500
7  192400      쿠쿠홀딩스  179204.666667  177500
8  199800         툴젠   -2514.333333  115400
9  204210     모두투어리츠    3093.333333    3475

       id       name           eps     bps        per       pbr
0  130960     CJ E&M   6301.333333   54068  15.695091  1.829178
1  136480         하림    274.166667    3551  11.489362  0.887074
2  138040    메리츠금융지주   2122.333333   14894   6.313806  0.899691
3  139480        이마트  18268.166667  295780  13.931338  0.860437
4  145990        삼양사   5741.000000  108090  14.283226  0.758627
5  161390      한국타이어   5648.500000   51341   7.453306  0.820007
6  181710  NHN엔터테인먼트   2110.166667   78434  30.755864  0.827447
7  185750        종근당   3990.333333   40684  25.185866  2.470259
8  204210     모두투어리츠     85.166667    5335  40.802348  0.651359
9  207940   삼성바이오로직스   4644.166667   60099  89.790059  6.938551

In [ ]:
# 교집합 : how=inner (디폴트 세팅)
# on = None : 병합 기준(None, 공통 열) 설정
# how=inner : 병합이 되는 방식(inner, 공통 인덱스) 설정
merge_inner = pd.merge(df1,df2) # 기준이 없어서 두 데이터프레임 그냥 합쳐짐
print(merge_inner)
print()

       id stock_name          value   price    name           eps     bps  \
0  130960     CJ E&M   58540.666667   98900  CJ E&M   6301.333333   54068
1  139480        이마트  239230.833333  254500     이마트  18268.166667  295780
2  145990        삼양사   82750.000000   82000     삼양사   5741.000000  108090
3  185750        종근당   40293.666667  100500     종근당   3990.333333   40684
4  204210     모두투어리츠    3093.333333    3475  모두투어리츠     85.166667    5335

         per       pbr
0  15.695091  1.829178
1  13.931338  0.860437
2  14.283226  0.758627
3  25.185866  2.470259
4  40.802348  0.651359

In [ ]:
# on = id : 병합 기준(id열) 설정
# how = outer : 합집합, 없는 데이터는 NaN으로 들어감
merge_outer = pd.merge(df1,df2,on='id',how='outer')
print(merge_outer)
print()

        id stock_name          value     price       name           eps  \
0   128940       한미약품   59385.666667  421000.0        NaN           NaN
1   130960     CJ E&M   58540.666667   98900.0     CJ E&M   6301.333333
2   138250      엔에스쇼핑   14558.666667   13200.0        NaN           NaN
3   139480        이마트  239230.833333  254500.0        이마트  18268.166667
4   142280     녹십자엠에스     468.833333   10200.0        NaN           NaN
5   145990        삼양사   82750.000000   82000.0        삼양사   5741.000000
6   185750        종근당   40293.666667  100500.0        종근당   3990.333333
7   192400      쿠쿠홀딩스  179204.666667  177500.0        NaN           NaN
8   199800         툴젠   -2514.333333  115400.0        NaN           NaN
9   204210     모두투어리츠    3093.333333    3475.0     모두투어리츠     85.166667
10  136480        NaN            NaN       NaN         하림    274.166667
11  138040        NaN            NaN       NaN    메리츠금융지주   2122.333333
12  161390        NaN            NaN       NaN      한국타이어   5648.500000
13  181710        NaN            NaN       NaN  NHN엔터테인먼트   2110.166667
14  207940        NaN            NaN       NaN   삼성바이오로직스   4644.166667

         bps        per       pbr
0        NaN        NaN       NaN
1    54068.0  15.695091  1.829178
2        NaN        NaN       NaN
3   295780.0  13.931338  0.860437
4        NaN        NaN       NaN
5   108090.0  14.283226  0.758627
6    40684.0  25.185866  2.470259
7        NaN        NaN       NaN
8        NaN        NaN       NaN
9     5335.0  40.802348  0.651359
10    3551.0  11.489362  0.887074
11   14894.0   6.313806  0.899691
12   51341.0   7.453306  0.820007
13   78434.0  30.755864  0.827447
14   60099.0  89.790059  6.938551

In [ ]:
# how='left' : left join, 왼쪽 데이터프레임을 기준으로 병합
#left_on / right_on : 각 데이터프레임에서 병합 기준이 될 칼럼 지정

merge_left = pd.merge(df1,df2,how='left',left_on='stock_name',right_on='name')
print(merge_left)

     id_x stock_name          value   price      id_y    name           eps  \
0  128940       한미약품   59385.666667  421000       NaN     NaN           NaN
1  130960     CJ E&M   58540.666667   98900  130960.0  CJ E&M   6301.333333
2  138250      엔에스쇼핑   14558.666667   13200       NaN     NaN           NaN
3  139480        이마트  239230.833333  254500  139480.0     이마트  18268.166667
4  142280     녹십자엠에스     468.833333   10200       NaN     NaN           NaN
5  145990        삼양사   82750.000000   82000  145990.0     삼양사   5741.000000
6  185750        종근당   40293.666667  100500  185750.0     종근당   3990.333333
7  192400      쿠쿠홀딩스  179204.666667  177500       NaN     NaN           NaN
8  199800         툴젠   -2514.333333  115400       NaN     NaN           NaN
9  204210     모두투어리츠    3093.333333    3475  204210.0  모두투어리츠     85.166667

        bps        per       pbr
0       NaN        NaN       NaN
1   54068.0  15.695091  1.829178
2       NaN        NaN       NaN
3  295780.0  13.931338  0.860437
4       NaN        NaN       NaN
5  108090.0  14.283226  0.758627
6   40684.0  25.185866  2.470259
7       NaN        NaN       NaN
8       NaN        NaN       NaN
9    5335.0  40.802348  0.651359

In [ ]:
import pandas as pd

df1 = pd.DataFrame({'stock_name': ['AAPL', 'GOOGL', 'MSFT'],
                    'value': [200, 500, 150]})
df2 = pd.DataFrame({'name': ['AAPL', 'GOOGL', 'AMZN'],
                    'price': [1500, 2000, 1800]})

merge_left = pd.merge(df1, df2, how='left', left_on='stock_name', right_on='name')
print(merge_left)

  stock_name  value   name   price
0       AAPL    200   AAPL  1500.0
1      GOOGL    500  GOOGL  2000.0
2       MSFT    150    NaN     NaN

In [ ]:
# how='right' : right join, 오쪽 데이터프레임을 기준으로 병합
#left_on / right_on : 각 데이터프레임에서 병합 기준이 될 칼럼 지정

merge_right = pd.merge(df1,df2,how='right',left_on='stock_name',right_on='name')
print(merge_right)

       id_x stock_name          value     price    id_y       name  \
0  130960.0     CJ E&M   58540.666667   98900.0  130960     CJ E&M
1       NaN        NaN            NaN       NaN  136480         하림
2       NaN        NaN            NaN       NaN  138040    메리츠금융지주
3  139480.0        이마트  239230.833333  254500.0  139480        이마트
4  145990.0        삼양사   82750.000000   82000.0  145990        삼양사
5       NaN        NaN            NaN       NaN  161390      한국타이어
6       NaN        NaN            NaN       NaN  181710  NHN엔터테인먼트
7  185750.0        종근당   40293.666667  100500.0  185750        종근당
8  204210.0     모두투어리츠    3093.333333    3475.0  204210     모두투어리츠
9       NaN        NaN            NaN       NaN  207940   삼성바이오로직스

            eps     bps        per       pbr
0   6301.333333   54068  15.695091  1.829178
1    274.166667    3551  11.489362  0.887074
2   2122.333333   14894   6.313806  0.899691
3  18268.166667  295780  13.931338  0.860437
4   5741.000000  108090  14.283226  0.758627
5   5648.500000   51341   7.453306  0.820007
6   2110.166667   78434  30.755864  0.827447
7   3990.333333   40684  25.185866  2.470259
8     85.166667    5335  40.802348  0.651359
9   4644.166667   60099  89.790059  6.938551

#### 미션

In [58]:
# 데이터 준비

import pandas as pd

df1 = pd.read_excel('/Users/choejong-gyu/Documents/05.데이터분석/data1/stock price.xlsx')
df2 = pd.read_excel('/Users/choejong-gyu/Documents/05.데이터분석/data1/stock valuation.xlsx')
print(df1,'\n')
print(df2,'\n')

       id stock_name          value   price
0  128940       한미약품   59385.666667  421000
1  130960     CJ E&M   58540.666667   98900
2  138250      엔에스쇼핑   14558.666667   13200
3  139480        이마트  239230.833333  254500
4  142280     녹십자엠에스     468.833333   10200
5  145990        삼양사   82750.000000   82000
6  185750        종근당   40293.666667  100500
7  192400      쿠쿠홀딩스  179204.666667  177500
8  199800         툴젠   -2514.333333  115400
9  204210     모두투어리츠    3093.333333    3475

       id       name           eps     bps        per       pbr
0  130960     CJ E&M   6301.333333   54068  15.695091  1.829178
1  136480         하림    274.166667    3551  11.489362  0.887074
2  138040    메리츠금융지주   2122.333333   14894   6.313806  0.899691
3  139480        이마트  18268.166667  295780  13.931338  0.860437
4  145990        삼양사   5741.000000  108090  14.283226  0.758627
5  161390      한국타이어   5648.500000   51341   7.453306  0.820007
6  181710  NHN엔터테인먼트   2110.166667   78434  30.755864  0.827447
7  185750        종근당   3990.333333   40684  25.185866  2.470259
8  204210     모두투어리츠     85.166667    5335  40.802348  0.651359
9  207940   삼성바이오로직스   4644.166667   60099  89.790059  6.938551

In [ ]:
# 나의 얼레벌레 -> df1에만 price라는 칼럼이 있기 때문에 masking 먼저 해야함 
stock_inner = pd.merge(df1,df2,how='inner', on='id')
stock_inner

# mask = stock_inner['price'] >= 50000
# stock_inner_mask = stock_inner[mask,:]

,id,stock_name,value,price,name,eps,bps,per,pbr
0,130960,CJ E&M,58540.666667,98900,CJ E&M,6301.333333,54068,15.695091,1.829178
1,139480,이마트,239230.833333,254500,이마트,18268.166667,295780,13.931338,0.860437
2,145990,삼양사,82750.000000,82000,삼양사,5741.000000,108090,14.283226,0.758627
3,185750,종근당,40293.666667,100500,종근당,3990.333333,40684,25.185866,2.470259
4,204210,모두투어리츠,3093.333333,3475,모두투어리츠,85.166667,5335,40.802348,0.651359

In [ ]:
price = df1[df1['price']>= 50000]
print(price.head())

       id stock_name          value   price
0  128940       한미약품   59385.666667  421000
1  130960     CJ E&M   58540.666667   98900
3  139480        이마트  239230.833333  254500
5  145990        삼양사   82750.000000   82000
6  185750        종근당   40293.666667  100500

In [ ]:
value = pd.merge(price,df2)
print(value)

       id stock_name          value   price    name           eps     bps  \
0  130960     CJ E&M   58540.666667   98900  CJ E&M   6301.333333   54068
1  139480        이마트  239230.833333  254500     이마트  18268.166667  295780
2  145990        삼양사   82750.000000   82000     삼양사   5741.000000  108090
3  185750        종근당   40293.666667  100500     종근당   3990.333333   40684

         per       pbr
0  15.695091  1.829178
1  13.931338  0.860437
2  14.283226  0.758627
3  25.185866  2.470259

### .join() : 데이터프레임 결합

In [59]:

df1 = pd.read_excel('/Users/choejong-gyu/Documents/05.데이터분석/data1/stock price.xlsx')
df2 = pd.read_excel('/Users/choejong-gyu/Documents/05.데이터분석/data1/stock valuation.xlsx')

In [60]:
# 데이터프레임 결합(join) , 두개의 데이터프레임을 인덱스를 기준으로 합치는 메서드

df3 = df1.join(df2) # 왼쪽인 df1의 인덱스를 기준으로 df2를 합침
print(df3)
print('\n')

# 데이터프레임 결합(join) - 교집합
df4 = df1.join(df2,how='inner')
print(df4)

ValueError: columns overlap but no suffix specified: Index(['id'], dtype='object')

## 02_5. 그룹 연산 : 데이터 안의 하위 그룹을 대상으로 연산 및 분석
단계 : 분할(split) -> 적용(apply) -> 결합(combine)

### .groupby([  ]) : 분할 split_데이터를 특정 조건에 의해 분할

In [67]:
# 데이터 준비
import pandas as pd
import seaborn as sns

titanic = sns.load_dataset('titanic')

df = titanic.loc[:,['age','sex','class','fare','survived']]  # : 행 , ['age','sex','class','fare','survived'] : 열
df = df.apply(pd.to_numeric, errors = 'coerce') # 숫자로 변환할수 없는 값이 있으면 NaN으로 처리
                                                # 여기서 class가 문자열이기 때문에 NaN으로 되어있음

print('승객 수',len(df))
print(df.head())
print('\n')

# class 기준으로 분할
grouped = df.groupby(['class'])
print(grouped)

for key,group in grouped:
    print("*key: ",key)
    print("*number: ",len(group))  # 출력이 되지않은 이유는 NaN이기 때문에
    print(group.head(5))
    print('\n')

승객 수 891
    age  sex  class     fare  survived
0  22.0  NaN    NaN   7.2500         0
1  38.0  NaN    NaN  71.2833         1
2  26.0  NaN    NaN   7.9250         1
3  35.0  NaN    NaN  53.1000         1
4  35.0  NaN    NaN   8.0500         0


<pandas.core.groupby.generic.DataFrameGroupBy object at 0x15ff9bf90>

### 적용 apply : 데이터를 집계, 변환, 필터링하는데 필요한 메소드 제공

In [68]:
average = grouped.mean(numeric_only=True) # 그룹 별 평균을 계산한 결과, numeric_only=True: 숫자형 열만 고려
print(average)
print('\n')

Empty DataFrame
Columns: [age, sex, fare, survived]
Index: []

In [ ]:
# # .get_group() : 개별 그룹 선택하기
group3 = grouped.get_group('Third')
print(group3.head())

    age     sex  class     fare  survived
0  22.0    male  Third   7.2500         0
2  26.0  female  Third   7.9250         1
4  35.0    male  Third   8.0500         0
5   NaN    male  Third   8.4583         0
7   2.0    male  Third  21.0750         0

#### 분할 -> 적용을 두 가지 열을 기준으로 해보기

In [74]:
# 데이터 준비
import pandas as pd
import seaborn as sns

titanic = sns.load_dataset('titanic')

df = titanic.loc[:,['age','sex','class','fare','survived']]

# print('승객 수',len(df))
# print(df.head())
# print('\n')

# class 열, sex 열을 기준으로 분할
grouped_two = df.groupby(['class','sex'])


for key, group in grouped_two:          # first,female -> first, male -> second,female ... -> third , male
    print("** key : ",key)
    print("** number: ",len(group))
    print(group.head())
    print('\n')

** key :  ('First', 'female')
** number:  94
     age     sex  class      fare  survived
1   38.0  female  First   71.2833         1
3   35.0  female  First   53.1000         1
11  58.0  female  First   26.5500         1
31   NaN  female  First  146.5208         1
52  49.0  female  First   76.7292         1


** key :  ('First', 'male')
** number:  122
     age   sex  class      fare  survived
6   54.0  male  First   51.8625         0
23  28.0  male  First   35.5000         1
27  19.0  male  First  263.0000         0
30  40.0  male  First   27.7208         0
34  28.0  male  First   82.1708         0


** key :  ('Second', 'female')
** number:  76
     age     sex   class     fare  survived
9   14.0  female  Second  30.0708         1
15  55.0  female  Second  16.0000         1
41  27.0  female  Second  21.0000         0
43   3.0  female  Second  41.5792         1
53  29.0  female  Second  26.0000         1


** key :  ('Second', 'male')
** number:  108
     age   sex   class  fare  survived
17   NaN  male  Second  13.0         1
20  35.0  male  Second  26.0         0
21  34.0  male  Second  13.0         1
33  66.0  male  Second  10.5         0
70  32.0  male  Second  10.5         0


** key :  ('Third', 'female')
** number:  144
     age     sex  class     fare  survived
2   26.0  female  Third   7.9250         1
8   27.0  female  Third  11.1333         1
10   4.0  female  Third  16.7000         1
14  14.0  female  Third   7.8542         0
18  31.0  female  Third  18.0000         0


** key :  ('Third', 'male')
** number:  347
     age   sex  class     fare  survived
0   22.0  male  Third   7.2500         0
4   35.0  male  Third   8.0500         0
5    NaN  male  Third   8.4583         0
7    2.0  male  Third  21.0750         0
12  20.0  male  Third   8.0500         0

In [75]:
average_two = grouped_two.mean() # 그룹두개의 평균
print(average_two)
print()
print(type(average_two))

                     age        fare  survived
class  sex
First  female  34.611765  106.125798  0.968085
       male    41.281386   67.226127  0.368852
Second female  28.722973   21.970121  0.921053
       male    30.740707   19.741782  0.157407
Third  female  21.750000   16.118810  0.500000
       male    26.507589   12.661633  0.135447

<class 'pandas.core.frame.DataFrame'>

In [ ]:
# .get_group() : 그룹별 개체 선택
group3f = grouped_two.get_group(('Third','female'))
print(group3f.head())

     age     sex  class     fare  survived
2   26.0  female  Third   7.9250         1
8   27.0  female  Third  11.1333         1
10   4.0  female  Third  16.7000         1
14  14.0  female  Third   7.8542         0
18  31.0  female  Third  18.0000         0

#### 여러 열을 기준으로 그룹화

In [76]:
import pandas as pd
import seaborn as sns

df = sns.load_dataset('titanic')
df = df.loc[:,['age','sex','class','fare','survived']]

grouped = df.groupby(['class'])

In [ ]:
# .std(): 표준편자 집계

std_all = grouped.std(numeric_only=True) # numeric_only = True -> 문자열이나 다른 데이터 타입은 표준편차에 제외
print(std_all)
print('\n')
print(type(std_all))
print('\n')

              age       fare  survived
class
First   14.802856  78.380373  0.484026
Second  14.001077  13.417399  0.500623
Third   12.495398  11.778142  0.428949


<class 'pandas.core.frame.DataFrame'>

In [ ]:
# fare열의 표준편차 집계

fare_std = grouped['fare'].std(numeric_only=True)
print(fare_std)

class
First     78.380373
Second    13.417399
Third     11.778142
Name: fare, dtype: float64

In [ ]:
# fare열의 표준편차 집계 2

fare_std2 = grouped.fare.std(numeric_only=True)
print(fare_std2)

class
First     78.380373
Second    13.417399
Third     11.778142
Name: fare, dtype: float64

In [77]:
# 그룹 객체에 agg() 메소드 적용
from pandas.api.types import is_numeric_dtype
# from pandas.api.types import is_string_dtype

def min_max(x):
    if is_numeric_dtype(x): # 만약 숫자형 일경우 x.max() - x.min()
        return x.max() - x.min()

agg_minmax = grouped.agg(min_max) # agg 메서드는 그룹 객체에 다양한 집계함수를 적용할 수 있는 메서드
print(agg_minmax.head())    # min_max 함수는 각열에 대해 수행
print('\n')

          age   sex      fare  survived
class
First   79.08  None  512.3292         1
Second  69.33  None   73.5000         1
Third   73.58  None   69.5500         1

In [ ]:
agg_sep = grouped.agg({'fare':['min','max'],'age':'mean'}) # fare에 대해서는 min,max값을 구하고 age는 mean평균값
print(agg_sep.head())

       fare                  age
        min       max       mean
class
First   0.0  512.3292  38.233441
Second  0.0   73.5000  29.877630
Third   0.0   69.5500  25.140620

### .agg() :결합 combine_ 적용까지 완료된 처리 결과를 하나로 결합

## 02_6. 멀티인덱스

## 02_7. 피벗